//IBMUSERD JOB (123),'SAI',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*
//STEP1 EXEC PGM=PGM01
//SYSPRINT DD SYSOUT=*
//STEPLIB DD DSN=ADCDS.LOAD.LIB,DISP=SHR
//CEEOPTS DD *
TEST(ALL,,PROMPT,TCPIP&10.10.5.6%8001:*)
/*
//SYSIN DD *
00005
00007
/*