//RUN03   JOB ('POPUP'),'POPUP',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*
//RUN   EXEC PGM=PGM03
//STEPLIB  DD DISP=SHR,DSN=IBMUSER.ZUNIT.DEMO.BATCH.LOAD
//SYSIN DD *
20
30
060
/*