//RUNCOBX JOB NOTIFY=&SYSUID,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(1440),REGION=144M,COND=(16,LT)
//GO EXEC   PROC=ELAXFGO,GO=CWKTCOBX,
//        LOADDSN=ADCDS.ZUNIT.BATCH.LOAD
//CEEOPTS DD *
TEST(,,,TCPIP&10.10.5.10%8001:*)
ENVAR("EQA_STARTUP_KEY=CC")
//SYSIN DD *
//EMPFILE  DD DISP=SHR,DSN=ADCDS.SOURCE.LIB(TTTDATD)
//RPTFILE  DD SYSOUT=*
//SYSOUT   DD SYSOUT=*